{"z12vzt2hcsuvizv0v224dbhzbxn3fjciu04.1491648859220275": {"text": "I am. I'll get a small commission every time someone orders through one of my links. It's at no extra cost to anyone, so it won't cost you any more but it's a way for me to get a small commission to keep my site going and support the work I'm doing  as well :)﻿", "time": "1 week ago", "author": "HowToLucid.com", "cid": "z12vzt2hcsuvizv0v224dbhzbxn3fjciu04.1491648859220275"}, "z12uht4whmmtzhjww04cermjkvf2hnsheq00k.1491486009145564": {"text": "Thanks!﻿", "time": "2 weeks ago", "author": "HowToLucid.com", "cid": "z12uht4whmmtzhjww04cermjkvf2hnsheq00k.1491486009145564"}, "z12vzt2hcsuvizv0v224dbhzbxn3fjciu04": {"text": "also just for transparency - are you doing an affiliate program with them in your blog?﻿", "time": "1 week ago", "author": "Michael Britton", "cid": "z12vzt2hcsuvizv0v224dbhzbxn3fjciu04"}, "z125db5xlrmtv3ckl22ijl3ioyvcubcxy04": {"text": "my question-\nover the last few months I've been trying to get my girlfriend to have a lucid dream as I have them quite often. last night I spent literally my whole lucid dream trying to convince her that we were in a dream together and I pointed out all the signs to her in the dream world, but no matter how many obvious things I pointed out she kept denying it.is this normal? I don't really know what I was trying to prove but maybe you can make a video about this?﻿", "time": "2 weeks ago", "author": "Mitchell Blais", "cid": "z125db5xlrmtv3ckl22ijl3ioyvcubcxy04"}, "z12oth3jouz3cd1nw22qh3y4rs2bd3h2d": {"text": "love the vids﻿", "time": "2 weeks ago", "author": "TSS NCS", "cid": "z12oth3jouz3cd1nw22qh3y4rs2bd3h2d"}, "z12qe10pux3wjfyvg224dbhzbxn3fjciu04": {"text": "I have a lot of experience in this area. Memory palaces can be useful for things that don't really matter. names and phone numbers are not important. Important information, unless really simple, should not be used in a memory palace. I want a good memory, so I can pass an exam. it is a complicated exam that does not rely on simple fact recall. it tests for my understanding. the process of making a memory palace for a subject I'm studying and the process for developing an understanding of a subject are not easily linked. Therefore, if it is important information, for example a subject you are studying, it is more effective to do it the traditional way. The reason a memory palace does not aid developing understanding is because the information is coded into imagery, which the brain's subconscious mostly won't interpret. I'm sure there will be a lot of people who disagree with me, perhaps you have other experiences. please share.﻿", "time": "2 weeks ago", "author": "Michael Britton", "cid": "z12qe10pux3wjfyvg224dbhzbxn3fjciu04"}, "z12uht4whmmtzhjww04cermjkvf2hnsheq00k": {"text": "love the intro﻿", "time": "2 weeks ago", "author": "dankus.memeius", "cid": "z12uht4whmmtzhjww04cermjkvf2hnsheq00k"}, "z12oth3jouz3cd1nw22qh3y4rs2bd3h2d.1491648878688184": {"text": "Thanks!﻿", "time": "1 week ago", "author": "HowToLucid.com", "cid": "z12oth3jouz3cd1nw22qh3y4rs2bd3h2d.1491648878688184"}, "z12uht4whmmtzhjww04cermjkvf2hnsheq00k.1491486031036559": {"text": "Did you have a look at the memory masterclass? What did you think?﻿", "time": "2 weeks ago", "author": "HowToLucid.com", "cid": "z12uht4whmmtzhjww04cermjkvf2hnsheq00k.1491486031036559"}}